---
kind: method
id: M:Autodesk.Revit.DB.DimensionEqualityLabelFormatting.GetFormatOptions
source: html/e94a97e3-c6a2-a29e-46aa-9889fd3b4a3c.htm
---
# Autodesk.Revit.DB.DimensionEqualityLabelFormatting.GetFormatOptions Method

Gets the format options used to show the parameter value.

## Syntax (C#)
```csharp
public FormatOptions GetFormatOptions()
```

## Returns
A copy of the format options.